# Pandas Stuff

In [1]:
import pandas as pd

## Load Dataset from List of Column Lists

This can be used to make dataset from query result.

In [2]:
lst = [
    ('tom', 25), 
    ('krish', 30), 
    ('nick', 26), 
    ('juli', 22)
] 
    
df = pd.DataFrame(lst, columns =['Name', 'Age']) 
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

Or with dtype

In [3]:
df = pd.DataFrame(lst, columns =['Name', 'Age'], dtype=float) 
df

    Name   Age
0    tom  25.0
1  krish  30.0
2   nick  26.0
3   juli  22.0

## Load Dataset from List of Row Lists

It doesn't work. Maybe the method name has changed.

In [4]:
sales = [('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
         ('Jan', [150, 200, 50]),
         ('Feb', [200, 210, 90]),
         ('Mar', [140, 215, 95]),
         ]
pd.DataFrame.from_dict(dict(sales))

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

## Load Dataset from Dictionary of Column Lists

In [5]:
# list of name, degree, score 
nme = ["aparna", "pankaj", "sudhir", "Geeku"] 
deg = ["MBA", "BCA", "M.Tech", "MBA"] 
scr = [90, 40, 80, 98] 
  
# dictionary of lists  
data = {'name': nme, 'degree': deg, 'score': scr}  
    
df = pd.DataFrame(data) 
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

Load Dataset from List of Dictionary Rows

In [6]:
data = [{'a': 1, 'b': 2, 'c':3}, {'a':10, 'b': 20, 'c': 30}] 
df = pd.DataFrame(data) 
df

    a   b   c
0   1   2   3
1  10  20  30